def decode(string):
 d ={
    'а': 10,
    'б': 11,
    'в': 12,
    'г': 13,
    'д': 14,
    'е': 15,
    'ж': 16,
    'з':17,
    'и': 9,
    'й': 10,
    'к': 11, 
    'л': 12,
    'м': 13,
    'н': 14,
    'о': 15,
    'п': 16,
    'р': 17,
    'с': 18,
    'т': 10,
    'у': 11,
    'ф': 12,
    'х': 13,
    'ц': 14,
    'ч': 15,
    'ш': 16,
    'щ': 17,
    'ъ': 18,
    'ы': 1,
    'ь': 2,
    'э': 3,
    'ю': 4,
    'я': 5,
    ' ': 5
}
 m = []
 for i in string:
    m.append(d[i])
 return m
print(decode('я люблю ананасы'))